{"sections":{"a3bbb423-b4e7-43e3-b687-2048271dba0d":{"type":"os-careers-page","blocks":{"3d6e3005-47af-4e7d-8ef7-6e5a77eed970":{"type":"Role","settings":{"role_heading":"Creative Design Intern","role_description":"<p>As a creative design intern, you have the unique opportunity to grow with the brand and experience every part of the business. This multi-faceted role will see you:<\/p><ul><li>Conducting visual research and presenting to the team<\/li><li>Contribute to the design process with ideas, mood boards and CADs<\/li><li>General office duties – opening parcels and distributing. Arranging national & international courier parcels.<\/li><\/ul><p>Due to the fast-paced nature of the job, Oceanus is looking for an individual who can excel under pressure. We are looking for someone who is:<\/p><ul><li>Organisation skills are crucial as you will be engaging with both the administration and design elements of the business.<\/li><li>Self-motivated and have great time management.<\/li><li>Enthusiastic & have a keen eye for detail.<\/li><li>Trend aware with a keen interest in fashion.<\/li><li>A natural creative and problem solver.<\/li><li>Team player with strong organisational skills<\/li><li>Proficient in Microsoft Office and Adobe Creative Suite including - Photoshop, Iluustrator and InDesign is also a must.<\/li><\/ul><p>To apply, you will need to submit a portfolio of your work along with a CV. Should your application be successful, you would begin your internship ASAP, the role will be a mixture of working from home and coming into the office. Apply today and remember, Oceanus is calling.<\/p><p>Please email <a href=\"mailto:info@oceanusswimwear.com\">info@oceanusswimwear.com<\/a> with CREATIVE DESIGN INTERN in the subject line.<\/p>"}},"deb0da29-5bcc-45aa-82cb-3543bb690bdc":{"type":"Role","settings":{"role_heading":"CREATIVE OFFICE \/ PERSONAL ASSISTANT","role_description":"<p>Oceanus is calling. Timeless and unapologetically irreverent, Oceanus is a sustainable swimwear brand making a splash in luxury fashion. Known for their artesian embroidery and 80s rival designs, the company is looking to expand rapidly over the next 12 months...<br\/><br\/><\/p><p>We are looking for an individual with experience of working as an Office and Personal Assistant to join our fast paced office in Battersea. Your day-to-day role will involve administration, organisational work, managing of team, and ensuring the smooth running of a busy office. To succeed in this role, you should have excellent communication and time management skills in order to carry out a wide range of tasks.<br\/><br\/><\/p><p>Duties to include:<\/p><ul><li>Creating invoices<\/li><li>Creating shipping labels<\/li><li>Working with our fulfilment centre to ship orders<\/li><li>Taking deliveries<\/li><li>Ensuring studio areas and meeting rooms are kept clear and tidy<\/li><li>Liaising with consumers and businesses<\/li><li>Assisting in Managing social media channels<\/li><li>Upkeep of website Assisting with recruitment<\/li><\/ul><p>Knowledge and Experience<\/p><p><\/p><ul><li>Good verbal communication skills with a strong grasp of English<\/li><li>Flexible approach to duties and ability to prioritise<\/li><li>Able to use initiative and work unsupervised<\/li><li>Excellent organisational skills<\/li><li>Attention to detail<\/li><li>Qualified to GCSE standard with Maths and English<\/li><li>Proficient in Microsoft Office in particular Word, Excel, Outlook and PowerPoint, additional knowledge of Adobe Pro would be an advantage<\/li><li>Excellent attendance and timekeeping<\/li><\/ul><p><\/p><p>Please email <a href=\"mailto:info@oceanusswimwear.com\">info@oceanusswimwear.com<\/a> with Creative Office\/ Personal Assistant in the subject line.<\/p>"}},"8776cfe7-a9a2-4b07-96b7-8a35e3a04c25":{"type":"Role","settings":{"role_heading":"PRODUCTION + WHOLESALE MANAGER","role_description":"<p>Oceanus is calling. Timeless and unapologetically irreverent, Oceanus is a sustainable swimwear brand making a splash in luxury fashion. Known for their artesian embroidery and 80s rival designs, the company is looking to expand rapidly over the next 12 months...<br\/><br\/>We are looking for a dynamic Production\/ Wholesale Manager to support the Creative Director and grow our wholesale channels. As Production\/ Wholesale Manager you will manage, steer and strengthen our wholesale business plan and act as a global brand ambassador representing and embodying our culture, values, and mission.<br\/><br\/>This is an exciting opportunity to join the team at a young and successful women’s swim brand based in Battersea London where you will support the development and manage Production\/ Wholesale.<br\/><br\/>Key Responsibilities:<\/p><ul><li>Support the team in the daily administration and contribute to the growth and development of global business.<\/li><li>Directly manage and build business with brand’s key accounts<\/li><li>Keep on top of active deadlines, follow critical path and ensure operations are running smoothly<\/li><li>Provide feedback to factories on production<\/li><li>Overseeing worldwide deliveries and ensuring smooth communication\/execution between internal departments; distribution\/logistics\/ customer service<\/li><li>Completing onboarding and documentation for new and existing accounts.<\/li><li>Contribute to providing excellent customer service and building solid relationships with key wholesale clients and sales agents.<\/li><li>Assist with preparing and sending out assets to wholesale clients in territory-relevant currencies and formats.<\/li><li>Work with the team to ensure all client requirements and relevant PO numbers are received in good time ahead of delivery.<\/li><li>Invoicing and following up with relevant teams. Collate all post-sales feedback to be issued to the wider team and enable further understanding of client requirements, best-selling formulas, or potential concerns.<\/li><li>Monitor and document client sell-through reports, with a view to highlighting any potential opportunities or risks.<\/li><li>Support with researching and preparing information on new business requests.<\/li><li>Ensure the brand is being presented correctly. Including checking pricing, imagery and product descriptions.<br\/><\/li><\/ul><p>What your day to day will look like<\/p><ul><li>Oversee the brand’s retail business activity within wholesale accounts, and ensure the brand is best positioned for growth within all doors.<\/li><li>Work closely with Design, Development, Merchandising, Production teams to support the development of range plans from a commercial perspective.<\/li><li>Direct high degree of market monitoring, result tracking as well as developing sales\/pricing strategies to keep the brand competitive and innovative.<\/li><li>Accurately forecast future sales and form sales analysis to capture constant shifts in the marketplace.<\/li><\/ul><p><\/p><p>IDEAL CANDIDATE<\/p><ul><li>Have proven experience working in a similar wholesale role. 3- 5 years’ experience ideally<\/li><li>Takes pride in their organisational skills and strong attention to detail.<\/li><li>Works well under pressure in a fast-paced environment, both independently and collaboratively with a team.<\/li><li>Excellent communication skills with an emphasis on good written and spoken English.<\/li><li>Positive and proactive attitude with an appetite to learn and grow within the role.<\/li><li>Good understanding of Microsoft Office - particularly Excel<\/li><li>Bachelor's Degree<\/li><li>Excellent Knowledge of MS Office (specifically Excel)<\/li><li>You are a dynamic leader who is analytical and detail-driven and you play for the team<\/li><\/ul><p><\/p><p>Please email <a href=\"mailto:info@oceanusswimwear.com\">info@oceanusswimwear.com<\/a> with Production + Wholesale Manager in the subject line.<\/p>"}},"ef479811-f2c4-4cf2-9a0f-4a78fdd92972":{"type":"Role","settings":{"role_heading":"CAN’T FIND A ROLE TO SUIT YOU?","role_description":"<p>If you would like to send us your details speculatively we would still like to hear from you.<br\/><br\/>Please clearly specify in the subject of your email the kind of role you think you would be a perfect fit for…this will help us to find your details if a role comes up<\/p>"}}},"block_order":["3d6e3005-47af-4e7d-8ef7-6e5a77eed970","deb0da29-5bcc-45aa-82cb-3543bb690bdc","8776cfe7-a9a2-4b07-96b7-8a35e3a04c25","ef479811-f2c4-4cf2-9a0f-4a78fdd92972"],"settings":{"heading":"JOIN OUR TEAM","subheading":"<p>WE ARE HIRING! LOOKING FOR INNOVATIVE CREATIVES TO JOIN THE BRAND.<\/p>","top_alignment":"center","container_width":90,"section_min_height":50,"padding_top":3,"padding_bottom":4,"padding_top1":2,"padding_bottom1":2}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":2,"padding_bottom":4}}},"order":["a3bbb423-b4e7-43e3-b687-2048271dba0d","main"]}