{"sections":{"4dc228a3-fe3c-48f5-9376-ec56ec6770d3":{"type":"os-sustainability-page","blocks":{"691db54c-f16e-48a0-86df-7d8cb3d341e2":{"type":"Card","settings":{"card_heading":"Our Commitment","card_paragraph":"<p>As a concious swimwear and resort brand, we are committed to minimizing our environmental impact while providing stylish and high-quality products. Our journey towards eco-friendliness begins with the materials we use. We prioritise fabrics made from recycled materials such as plastic bottles and fishing nets, as well as organic cotton and hemp, to reduce our reliance on virgin resources and contribute to waste reduction efforts.<\/p>","card_rotation":-3,"card_shift":-9}},"813e3c61-d144-43f2-8e18-f88bd93bc1aa":{"type":"Card","settings":{"card_heading":"Product","card_paragraph":"<p>When it comes to the production it is important for us to use the right fabrics and minimise textile waste. All our pieces are fully sustainable. The Lycra we use is ECONYL®, a fabric made from recycled fishing nets regenerated from the ocean. The embroidery beading is biodegradable, which means it is decomposable and thereby not polluting the environment. We do not use any animal derived materials.<br\/><br\/>As we strive to be zero waste, we make sure to reuse all beading from damaged or defective items. Our facemasks and smaller accessories are made from left over cut-offs from the swimwear production, and our unused stock from past collections is either recycled or remade into a new style.<\/p>","card_rotation":3,"card_shift":12}},"3344feb9-153d-42be-bc73-dd31f05f5cb7":{"type":"Card","settings":{"card_heading":"People","card_paragraph":"<p>In addition to our eco-conscious materials, we prioritise ethical manufacturing processes. We work with suppliers to ensure they adhere to fair labor practices and prioritise worker well-being, with the aim of maintaining transparent supply chains, to ensure that every step of our production process upholds our commitment to improved sustainability and ethicality.<\/p>","card_rotation":-1,"card_shift":-10}},"21f6106b-b523-48db-8dc7-82fc12ce2db5":{"type":"Card","settings":{"card_heading":"Packaging","card_paragraph":"<p>Furthermore, we are working to minimise packaging waste by focusing on aiming to use recyclable and biodegradable materials whenever possible. Our packaging is designed to be minimalistic yet protective, reflecting our dedication to reducing unnecessary waste in every aspect of our business.<\/p>","card_rotation":3,"card_shift":14}},"card_4FNmAm":{"type":"Card","settings":{"card_heading":"More than just a brand","card_paragraph":"<p>Beyond our products, we aim to educate and inspire our customers to make more sustainable choices in their lives. Through our marketing campaigns and social media channels, we share tips on eco-friendly living and promote environmental awareness. Ultimately, our goal is to prove that fashion and sustainability can coexist harmoniously. By choosing our brand, customers not only enjoy stylish and comfortable swimwear and resort wear but also contribute to a more sustainable future for our planet.<\/p>","card_rotation":0,"card_shift":0}},"51cd90d5-a1df-4627-863c-572d0f693e47":{"type":"Card","settings":{"card_heading":"Want to find out more?","card_paragraph":"<p>Please contact<\/p><p><a href=\"mailto:customerservice@OCEANUSSWIMWEAR.COM\" title=\"mailto:customerservice@OCEANUSSWIMWEAR.COM\">customerservice@oceanusswimwear.com<\/a><\/p><p>if you would like to view our Code of Conduct or Sustainable Sourcing Policy<\/p>","card_rotation":-2,"card_shift":0}}},"block_order":["691db54c-f16e-48a0-86df-7d8cb3d341e2","813e3c61-d144-43f2-8e18-f88bd93bc1aa","3344feb9-153d-42be-bc73-dd31f05f5cb7","21f6106b-b523-48db-8dc7-82fc12ce2db5","card_4FNmAm","51cd90d5-a1df-4627-863c-572d0f693e47"],"settings":{"heading":"Our love letter to the planet","subheading":"","top_alignment":"center","icon_image":"shopify:\/\/shop_images\/sustainability_card.png","card_bgcolor":"#fff0e1","card_border_color":"#fceac1","card_text_color":"#f1a3c4","padding_top":0,"padding_bottom":4}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":4,"padding_bottom":4}}},"order":["4dc228a3-fe3c-48f5-9376-ec56ec6770d3","main"]}